_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_РасчетБазисныхИТекущихЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_РасчетБазисныхИТекущихЦен</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРасценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МебельИнвентарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_РасчетБазисныхИТекущихЦен/Forms/Форма/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

// При создании формы на сервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
// Функция отбирает позиции выбранной сметы согласно условиям отбора.
// Возвращает массив позиций.
Функция ОтобратьНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СМ_ПозицияЛокальнойСметы.Ссылка КАК Позиция,
	|	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца КАК ПозицияВладелец
	|ИЗ
	|	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	|ГДЕ
	|	СМ_ПозицияЛокальнойСметы.ИДСметы = &ИДСметы
	|	И СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ";
	
	Если ВыборТипаМатериала = 0 Тогда				   
		Запрос.Текст = Запрос.Текст  + " 	И СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = &Материал";
	ИначеЕсли ВыборТипаМатериала = 1 Тогда				   
		Запрос.Текст = Запрос.Текст  + " 	И СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = &Оборудование";
	ИначеЕсли ВыборТипаМатериала = 2 Тогда				   
		Запрос.Текст = Запрос.Текст  + " 	И (СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = &Оборудование
		|	ИЛИ СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = &Материал)";
	КонецЕсли;	
	Если ВыборЦен = 0 Тогда
		Запрос.Текст = Запрос.Текст  + " 	И СМ_ПозицияЛокальнойСметы.ПрямЗатраты = 0
		|	И СМ_ПозицияЛокальнойСметы.Оборудование = 0";
	ИначеЕсли ВыборЦен = 1 Тогда	
		Запрос.Текст = Запрос.Текст  + " 	И СМ_ПозицияЛокальнойСметы.ТекущаяЦена = 0 ";
	КонецЕсли;
	Если ОтборПоКоэффициенту = Истина Тогда
		Запрос.Текст = Запрос.Текст  + " 	И СМ_ПозицияЛокальнойСметы.КоэффициентПересчетаЦен = &ЗначениеКоэффициента";
	КонецЕсли;	
	Запрос.УстановитьПараметр("ИДСметы",ЛокальнаяСмета);
	Запрос.УстановитьПараметр("Материал",Перечисления.СМ_ВидыРасценки.Материал);
	Запрос.УстановитьПараметр("Оборудование",Перечисления.СМ_ВидыРасценки.Оборудование);
	Если ОтборПоКоэффициенту = Истина Тогда
		Запрос.УстановитьПараметр("ЗначениеКоэффициента",КоэффициентПоиска);
	КонецЕсли;
	МассивПозиций = Новый Массив();
	
	МассивПозиций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Позиция");
	Если ТолькоПривязанные = Истина Тогда
		Сч = 0;
		Для Каждого СтрокаМассива  Из МассивПозиций Цикл
			ИДВладельца = СтрокаМассива.ИдПозицииВладельца;
			Если  ИДВладельца.Пустая() Тогда
				МассивПозиций.Удалить(Сч);
			КонецЕсли;
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли;
	Возврат(МассивПозиций);
	
КонецФункции

&НаСервере
// Процедура возвращает структуру значений реквизитов позиции.
// Параметры 1 - Ссылка на документ позицию, 2 - Структура возвращаемых значений реквизитов. 
Процедура ПолучитьПараметрыПозиции(СсылкаНаДокумент, СтруктураПараметров)
	СтруктураПараметров.Вставить("Наименование", СсылкаНаДокумент.Наименование);
	СтруктураПараметров.Вставить("ШифрРасценки", СсылкаНаДокумент.ШифрРасценки);
	СтруктураПараметров.Вставить("ТекущаяЦена", СсылкаНаДокумент.ТекущаяЦена);
	СтруктураПараметров.Вставить("ФормулаТекущейЦены", СсылкаНаДокумент.ФормулаТекущейЦены);
	СтруктураПараметров.Вставить("БазиснаяЦена", СсылкаНаДокумент.ПрямЗатраты + СсылкаНаДокумент.Оборудование);
	СтруктураПараметров.Вставить("ФормулаБаз", ?(СсылкаНаДокумент.Определитель.ВидРасценки  = Перечисления.СМ_ВидыРасценки.Материал,СсылкаНаДокумент.ФормулаСМ,СсылкаНаДокумент.ФормулаОб));
	СтруктураПараметров.Вставить("КоэффициентПересчетаЦен", СсылкаНаДокумент.КоэффициентПересчетаЦен);
	СтруктураПараметров.Вставить("ФормулаКоэффициентаПересчетаЦен", СсылкаНаДокумент.ФормулаКоэффициентаПересчетаЦен);
	
КонецПроцедуры

&НаСервере
// Процедура сохранения пересчитанных позиций в смете.
Процедура СохранитьНаСервере()
	// Пересчет базисной цены по текущей цене = 0, пересчет текущей цены по базисной цене = 1.
	БазисныйРасчет = ?(РасчетБазиснойЦены = 0, Истина, Ложь);
	Если ТаблРасчета.Количество() <> 0 Тогда
		Для Каждого СтрокаПозиции Из ТаблРасчета  Цикл
			Если СтрокаПозиции.Отметка = Истина Тогда
				Ссылка = СтрокаПозиции.Позиция;
				ОбъектПозиции = Ссылка.ПолучитьОбъект();
				Если БазисныйРасчет = Истина Тогда
					ТекущаяЦена = СтрокаПозиции.ТекущаяЦена; 
					ФормулаТекЦены = СтрокаПозиции.ФормулаТекущейЦены;
					БазиснаяЦена = СтрокаПозиции.РезультатПересчета;
					КоэффициентПересчетаЦен = СтрокаПозиции.КоэффициентПересчетаЦен;
					ФормулаКоэффициентаПересчетаЦен = СтрокаПозиции.ФормулаКоэффициентаПересчетаЦен;
					Если ОбъектПозиции.Определитель.ВидРасценки  = Перечисления.СМ_ВидыРасценки.Материал Тогда
						ОбъектПозиции.ПрямЗатраты = БазиснаяЦена;
						ОбъектПозиции.СтоимМатериалов = БазиснаяЦена;
						ФормулаСМ = СокрЛП(Строка(СтрокаПозиции.ТекущаяЦена)) + ?(СтрДлина(ФормулаКоэффициентаПересчетаЦен) = 0,"/"+ СокрЛП(Строка(КоэффициентПересчетаЦен)),"/("+ ФормулаКоэффициентаПересчетаЦен + ")"); 
						ОбъектПозиции.ФормулаСМ = ФормулаСМ;
						ОбъектПозиции.ФормулаКоэффициентаПересчетаЦен = ФормулаКоэффициентаПересчетаЦен;
						ОбъектПозиции.КоэффициентПересчетаЦен = КоэффициентПересчетаЦен;
					Иначе
						ОбъектПозиции.Оборудование = БазиснаяЦена;
						ФормулаОб = СокрЛП(Строка(СтрокаПозиции.ТекущаяЦена)) + ?(СтрДлина(ФормулаКоэффициентаПересчетаЦен) = 0,"/"+ СокрЛП(Строка(КоэффициентПересчетаЦен)),"/("+ ФормулаКоэффициентаПересчетаЦен + ")"); 
						ОбъектПозиции.ФормулаОб = ФормулаОб;
						ОбъектПозиции.ФормулаКоэффициентаПересчетаЦен = ФормулаКоэффициентаПересчетаЦен;
						ОбъектПозиции.КоэффициентПересчетаЦен = КоэффициентПересчетаЦен;
					КонецЕсли;
					Если ОбъектПозиции.ТекущаяЦена <> ТекущаяЦена Тогда
						ОбъектПозиции.ТекущаяЦена = ТекущаяЦена;
					КонецЕсли;
					Если ОбъектПозиции.ФормулаТекущейЦены <> ФормулаТекЦены Тогда
						ОбъектПозиции.ФормулаТекущейЦены = ФормулаТекЦены;
					КонецЕсли;
				Иначе
					// Пересчет базисной цены в тек. цену.
					ТекущаяЦена = СтрокаПозиции.РезультатПересчета;
					БазиснаяЦена = СтрокаПозиции.БазиснаяЦена;
					КоэффициентПересчетаЦен = СтрокаПозиции.КоэффициентПересчетаЦен;
					ФормулаКоэффициентаПересчетаЦен = СтрокаПозиции.ФормулаКоэффициентаПересчетаЦен;
					ОбъектПозиции.ТекущаяЦена = ТекущаяЦена;
					ФормулаТекЦены = СокрЛП(Строка(СтрокаПозиции.БазиснаяЦена)) + ?(СтрДлина(ФормулаКоэффициентаПересчетаЦен) = 0,"*"+ СокрЛП(Строка(КоэффициентПересчетаЦен)),"*("+ ФормулаКоэффициентаПересчетаЦен + ")"); 
					ОбъектПозиции.ФормулаТекущейЦены = ФормулаТекЦены;
					ОбъектПозиции.ФормулаКоэффициентаПересчетаЦен = ФормулаКоэффициентаПересчетаЦен;
					ОбъектПозиции.КоэффициентПересчетаЦен = КоэффициентПересчетаЦен;
					Если ОбъектПозиции.Определитель.ВидРасценки  = Перечисления.СМ_ВидыРасценки.Материал Тогда
						Если  ОбъектПозиции.ПрямЗатраты <> БазиснаяЦена Тогда
							ОбъектПозиции.ПрямЗатраты = БазиснаяЦена;
							ОбъектПозиции.ФормулаПЗ = СокрЛП(Строка(БазиснаяЦена));
							ОбъектПозиции.СтоимМатериалов = БазиснаяЦена;
							ОбъектПозиции.ФормулаСМ = СокрЛП(Строка(БазиснаяЦена));
						КонецЕсли;
					Иначе
						Если ОбъектПозиции.Оборудование <> БазиснаяЦена Тогда
							ОбъектПозиции.Оборудование = БазиснаяЦена;
							ФормулаОб = СокрЛП(Строка(БазиснаяЦена));
							ОбъектПозиции.ФормулаОб = ФормулаОб;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Попытка
					ОбъектПозиции.Записать();
					СМ_СметаВызовСервера.УдалитьДвижения(ОбъектПозиции);
					Документы.СМ_ПозицияЛокальнойСметы.Перерасчет(ОбъектПозиции, Ложь);

				Исключение
					Событие = НСтр("ru = 'Исключение Расчет базисных и текущих цен'");
					СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Вызов процедур пересчета сметы.
Процедура ПересчетСметы()
	СМ_СметаВызовСервера.УдалитьДвижения(ЛокальнаяСмета);
	Документы.СМ_ЛокальнаяСмета.Перерасчет(ЛокальнаяСмета, Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
// Процедура вызывает процедуру отбора позиции.
Процедура Отобрать(Команда)
	Если ЛокальнаяСмета.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru = 'Не выбрана смета!'"));
		Возврат;
	КонецЕсли;	
	МассивПозиций = ОтобратьНаСервере();
	ЗаполнениеТаблицыРасчета(МассивПозиций);
КонецПроцедуры

&НаКлиенте
// Процедура заполнения таблицы расчета цен.
// Параметр - массив позиций.
Процедура ЗаполнениеТаблицыРасчета(МассивПозиций)
	ТаблРасчета.Очистить();	
	Для Каждого СтрокаПозиции Из МассивПозиций Цикл
		НоваяСтрока = ТаблРасчета.Добавить();
		ТекПозиция =  СтрокаПозиции;
		СтруктураПараметров = Новый Структура("ШифрРасценки, Наименование, ТекущаяЦена,ФормулаТекущейЦены,БазиснаяЦена,ФормулаБаз,КоэффициентПересчетаЦен,ФормулаКоэффициентаПересчетаЦен");
		НоваяСтрока.Позиция =  ТекПозиция ;
		ПолучитьПараметрыПозиции(ТекПозиция, СтруктураПараметров);
		НоваяСтрока.ШифрРасценки = СтруктураПараметров.ШифрРасценки;
		НоваяСтрока.Наименование = СтруктураПараметров.Наименование;
		НоваяСтрока.ТекущаяЦена = СтруктураПараметров.ТекущаяЦена;
		НоваяСтрока.БазиснаяЦена = СтруктураПараметров.БазиснаяЦена;
		НоваяСтрока.ФормулаТекущейЦены = СтруктураПараметров.ФормулаТекущейЦены;
		НоваяСтрока.ФормулаБаз = СтруктураПараметров.ФормулаБаз;
		НоваяСтрока.КоэффициентПересчетаЦен = СтруктураПараметров.КоэффициентПересчетаЦен;
		НоваяСтрока.ФормулаКоэффициентаПересчетаЦен = СтруктураПараметров.ФормулаКоэффициентаПересчетаЦен;
	КонецЦикла;	
	Элементы.Группа1.ТекущаяСтраница = Элементы.Группа1.ПодчиненныеЭлементы.Группа2;

КонецПроцедуры	

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого СтрокаТабл Из ТаблРасчета Цикл
		СтрокаТабл.Отметка = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	Для Каждого СтрокаТабл Из ТаблРасчета Цикл
		СтрокаТабл.Отметка = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
// Процедура обработки команды ОтметитПоКоду.
Процедура ОтметитПоКоду(Команда)
	
	СтрокаПоиска = СокрЛП(СтрокаДляОтметки);
	Если СтрДлина(СтрокаПоиска) = 0 Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого СтрокаТабл Из ТаблРасчета Цикл
		Если Найти(ВРег(СтрокаТабл.ШифрРасценки),ВРег(СтрокаПоиска)) <> 0 Тогда
			СтрокаТабл.Отметка = Истина;
		Иначе
			СтрокаТабл.Отметка = Ложь;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
// Процедура обработки команды ОтметитПоКоду.
Процедура ОтметитьПоНаименованию(Команда)
	СтрокаПоиска = СокрЛП(СтрокаДляОтметки);
	Если СтрДлина(СтрокаПоиска) = 0 Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого СтрокаТабл Из ТаблРасчета Цикл
		Если Найти(ВРег(СтрокаТабл.Наименование),ВРег(СтрокаПоиска)) <> 0 Тогда
			СтрокаТабл.Отметка = Истина;
		Иначе
			СтрокаТабл.Отметка = Ложь;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
// Процедура вычисляет коэффициент по заданной формуле.
Процедура НоваяФормулаКоэффициентаПриИзменении(Элемент)
	Попытка
		ТекФормула = НоваяФормулаКоэффициента;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		НоваяФормулаКоэффициента = ТекФормула;

		НовыйКоэффициент = Окр(Вычислить(ТекФормула),3);
	Исключение
		НовыйКоэффициент = 0;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
// Функция убирает недопустимые символы для расчета формулы. 
Функция ОчиститьФормулу(ТекФормула)
	ТекФормула = СтрЗаменить(ТекФормула,",",".");
	НоваяФормула = "";
	СтрокаСимв = "1234567890+-*/().";	
	Для сч = 1 По СтрДлина(ТекФормула) Цикл
		ТекСимв = Сред(ТекФормула,Сч,1);
		Если Найти(СтрокаСимв,ТекСимв) <> 0 Тогда
			НоваяФормула = НоваяФормула + ТекСимв;
		КонецЕсли;
	КонецЦикла;	
	Возврат (НоваяФормула);
	
КонецФункции

&НаКлиенте
// Процедура проверки соответствия формулы коэффициента значению коэффициента. 
Процедура НовыйКоэффициентПриИзменении(Элемент)
	Если СтрДлина(СокрЛП(НоваяФормулаКоэффициента)) <> 0 Тогда
		РассчитанныйКоэффициент = 0;
		Попытка
			ТекФормула = НоваяФормулаКоэффициента;
			ТекФормула = ОчиститьФормулу(ТекФормула);
			НоваяФормулаКоэффициента = ТекФормула;
			
			РассчитанныйКоэффициент = Окр(Вычислить(ТекФормула),3);
		Исключение
			РассчитанныйКоэффициент = 0;
		КонецПопытки;
		Если РассчитанныйКоэффициент <> 0 И РассчитанныйКоэффициент <> НовыйКоэффициент  Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма,);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Заданный коэффицент не совпадает с рассчитанным по формуле! Формула будет очищена. Продолжать?';"
			+ " en = 'Do you want to continue?'"), Режим, 0);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		НоваяФормулаКоэффициента = "";
        Возврат;
    КонецЕсли;
КонецПроцедуры
&НаКлиенте
// Процедура обработки команды 
Процедура ЗанестиВТаблицу(Команда)
	Для Каждого СтрокаТабл Из ТаблРасчета Цикл
		Если СтрокаТабл.Отметка = Истина Тогда
			СтрокаТабл.КоэффициентПересчетаЦен = НовыйКоэффициент;
			СтрокаТабл.ФормулаКоэффициентаПересчетаЦен = НоваяФормулаКоэффициента;
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
// Процедура расчета цен с новым коэффициентом.
Процедура Рассчитать(Команда)
	Если РасчетБазиснойЦены = 0 Тогда
		// Базисной цены по текущей. 
		Для Каждого СтрокаТабл Из ТаблРасчета Цикл
			Если СтрокаТабл.Отметка = Истина Тогда
				Результат = Окр(СтрокаТабл.ТекущаяЦена / СтрокаТабл.КоэффициентПересчетаЦен,2);
				СтрокаТабл.РезультатПересчета = Результат;
				ФормулаБаз = СокрЛП(Строка(СтрокаТабл.ТекущаяЦена)) +
				?(СтрДлина(СтрокаТабл.ФормулаКоэффициентаПересчетаЦен) = 0,"/"+ СокрЛП(Строка(СтрокаТабл.КоэффициентПересчетаЦен)),"/("+ СтрокаТабл.ФормулаКоэффициентаПересчетаЦен + ")");  
				СтрокаТабл.ФормулаБаз = ФормулаБаз; 
				СтрокаТабл.БазиснаяЦена = Результат;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Расчет текущей цены по базисной.
		Для Каждого СтрокаТабл Из ТаблРасчета Цикл
			Если СтрокаТабл.Отметка = Истина Тогда
				Результат = Окр(СтрокаТабл.БазиснаяЦена * СтрокаТабл.КоэффициентПересчетаЦен,2);
				СтрокаТабл.РезультатПересчета = Результат;
				ФормулаТекущейЦены = СокрЛП(Строка(СтрокаТабл.БазиснаяЦена)) + ?(СтрДлина(СтрокаТабл.ФормулаКоэффициентаПересчетаЦен) = 0,"*"+ СокрЛП(Строка(СтрокаТабл.КоэффициентПересчетаЦен)),"*("+ СтрокаТабл.ФормулаКоэффициентаПересчетаЦен + ")");  
				СтрокаТабл.ФормулаТекущейЦены = ФормулаТекущейЦены;
				СтрокаТабл.ТекущаяЦена = Результат;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура обработки команды "Сохранить".
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	ПересчетСметы();
	МассивПозиций = ОтобратьНаСервере();
	ЗаполнениеТаблицыРасчета(МассивПозиций);
КонецПроцедуры

&НаКлиенте
// Процедура вызывает обновление дерева смет.
Процедура ПриЗакрытии()

	СписокДействий = Новый Массив;
	СписокДействий.Добавить("ОбновитьДерево");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СписокДействий",СписокДействий);
	СтруктураПараметров.Вставить("НовыйОбъект",Неопределено);
	СтруктураПараметров.Вставить("Смета",ЛокальнаяСмета);

	Оповестить("ОбновитьДеревоСметы",СтруктураПараметров); 
	
КонецПроцедуры

&НаКлиенте
// Процедура обработки переключателя "РасчетБазиснойЦены".
Процедура РасчетБазиснойЦеныПриИзменении(Элемент)
	Если РасчетБазиснойЦены = 0 Тогда
		// Базисная рассчитывается по текущей.
		Элементы.ТаблРасчетаФормулаБаз.Видимость = Истина;
		Элементы.ТаблРасчетаФормулаТекЦены.Видимость = Ложь;
	Иначе
		Элементы.ТаблРасчетаФормулаБаз.Видимость = Ложь;
		Элементы.ТаблРасчетаФормулаТекЦены.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Базисная рассчитывается по текущей.
	// Это вариант расчета при открытии.
	
	Если Параметры.Свойство("ВыбраннаяСмета") И ЗначениеЗаполнено(Параметры.ВыбраннаяСмета) Тогда
		ЛокальнаяСмета = Параметры.ВыбраннаяСмета;
	КонецЕсли;
	
	Элементы.ТаблРасчетаФормулаБаз.Видимость = Истина;
	Элементы.ТаблРасчетаФормулаТекЦены.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти

#Область НаУдаление

//&НаСервере
//// Процедура проверяет наличие актов в выбранной смете.
//Процедура Удалить_ПроверитьАкты()
//	
//	СуществуютАкты = СМ_УчетВыполненныхРаботСервер.СуществуютАктыПоСмете(ЛокальнаяСмета.Ссылка);
//	ТаблРасчета.Очистить();
//	
//КонецПроцедуры

#КонецОбласти
